app/controllers/feedbacks_controller.rb

  def index
    @feedback = Feedback.all
---
SELECT "feedbacks".* FROM "feedbacks"  ORDER BY created_at DESC

  def create
  	@feedback = Feedback.new(feedback_params)
  	if @feedback.save
---
INSERT INTO "feedbacks" ("author", "email", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "Roman"], ["email", "rm@kk.com"], ["text", "Hi! Nice site!"], ["created_at", "2015-09-15 18:07:41.861945"], ["updated_at", "2015-09-15 18:07:41.861945"]]