app/controllers/posts_controller.rb

	def show
		@post = Post.find_by_id(params[:id]) or not_found
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 6]]

	def create
		@post = Post.new(params_req)
		if signed_in?
			@post.author = current_user.name
		end

		if @post.save
---
INSERT INTO "posts" ("title", "text", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Post 1"], ["text", "First added post!"], ["author", "Me"], ["created_at", "2015-09-15 06:53:39.848344"], ["updated_at", "2015-09-15 06:53:39.848344"]]

	def index
		@post = Post.paginate(:page => params[:page], :per_page => 5)
---
SELECT  "posts".* FROM "posts"  ORDER BY created_at DESC LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "posts"